MyDIPLOM/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ОстаткиОтпусков</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

MyDIPLOM/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	
	НачалоОтпуска = НачалоДня(ТекущиеДанные.ДатаНачала);
	КонецОтпуска = НачалоДня(ТекущиеДанные.ДатаОкончания);
	ДеньСек = 86400;
	
	Если Не ЗначениеЗаполнено(КонецОтпуска) Тогда
		ТекущиеДанные.КоличествоДней = 0;
	Иначе
		ТекущиеДанные.КоличествоДней = (КонецОтпуска - НачалоОтпуска + ДеньСек) / ДеньСек;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	
	НачалоОтпуска = НачалоДня(ТекущиеДанные.ДатаНачала);
	КонецОтпуска = НачалоДня(ТекущиеДанные.ДатаОкончания);
	ДеньСек = 86400;
	
	Если Не ЗначениеЗаполнено(НачалоОтпуска) Тогда
		ТекущиеДанные.КоличествоДней = 0;
	Иначе
		ТекущиеДанные.КоличествоДней = (КонецОтпуска - НачалоОтпуска + ДеньСек) / ДеньСек;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафика(Команда)
	
	АдресОтпусковВХранилище = ПоместитьОтпускВХранилище();
	ПараметрыПодбора = Новый Структура("АдресОтпусковДокумента", АдресОтпусковВХранилище);  
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыПодбора, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПоместитьОтпускВХранилище() 
	
	ОтобранныеОтпуска = Объект.ОтпускаСотрудников.Выгрузить();
	ОтобранныеОтпуска.ВыгрузитьКолонку("Сотрудник");
	ОтобранныеОтпуска.ВыгрузитьКолонку("ДатаНачала");
	ОтобранныеОтпуска.ВыгрузитьКолонку("ДатаОкончания");
	
	Возврат ПоместитьВоВременноеХранилище(ОтобранныеОтпуска, УникальныйИдентификатор);

КонецФункции

#КонецОбласти
